Instructions to run to prepare the vignette (to run before installing the package)

- export R code
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
## devtools::build_vignettes("BuyseTest", quiet = FALSE) ## generate the META & DOC folder
library(butils.base)
setwd(pathGitHub())
extractRchunk(file = "./BuyseTest/inst/doc-Wilcoxon/wilcoxonTest.org",
              newfile = "./BuyseTest/vignettes/wilcoxonTest.pdf.asis",
              header = c("%\\VignetteIndexEntry{BuyseTest: wilcoxon test}",
                         "%\\VignetteEngine{R.rsp::asis}",
                         "%\\VignetteKeyword{PDF}",
                         "%\\VignetteKeyword{vignette}",
                         "%\\VignetteKeyword{package}",
                         ""),
              overwrite = TRUE)
#+END_SRC

#+RESULTS:
#+begin_example
Loading required package: data.table
data.table 1.18.2.1 using 8 threads (see ?getDTthreads).  Latest news: r-datatable.com
Loading required package: devtools
Loading required package: usethis

Attaching package: ‘devtools’

The following object is masked from ‘package:testthat’:

    test_file

butils.base version 1.3
#+end_example

- move to directory containing the package, compress vignette pdf file, and copy to =doc= and =vignettes= directories
#+BEGIN_SRC shell
cd ~/Documents/GitHub/BuyseTest/inst/doc-wilcoxonTest/
gs -sDEVICE=pdfwrite -dCompatibilityLevel=1.4 -dPDFSETTINGS=/printer -dNOPAUSE -dQUIET -dBATCH -sOutputFile=wilcoxonTest-compress.pdf wilcoxonTest.pdf
cp wilcoxonTest-compress.pdf ../../vignettes/wilcoxonTest.pdf 
cp wilcoxonTest.R ../../vignettes/wilcoxonTest.R 
#+END_SRC

#+RESULTS:

